# Time Series: Data Acquisition Exercises

<hr style="border:2px solid blue"> </hr>

### 1. Using the code from the lesson as a guide and the REST API from https://python.zgulde.net/api/v1/items as we did in the lesson, create a dataframe named items that has all of the data for items.

In [1]:
# Data Science Libraries
import pandas as pd

# New libraries for this lesson
import requests

In [2]:
# Requesting the data from the website
response = requests.get('https://python.zgulde.net/api/v1/items')

# Inspecting data received 
data = response.json()
data['payload']['next_page']

'/api/v1/items?page=2'

Since the exercises wants "all of the data for items", with the keyword being "all"; I will need to grab all the items from the other pages as well.

In [3]:
# Starting the dataframe with the data I have so far
items = pd.DataFrame(data['payload']['items'])

# What is the shape?
items.shape

(20, 6)

In [4]:
# What page is next?
data['payload']['next_page']

'/api/v1/items?page=2'

In [5]:
# What does my dataframe look like so far?
items.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

In [6]:
# Requesting information on next_page (page 2)
response = requests.get('https://python.zgulde.net' + data['payload']['next_page'])
data = response.json()

# Inspecting pages
print('max_page: %s' % data['payload']['max_page'])
print('next_page: %s' % data['payload']['next_page'])

# Concatenating page 2 items to page 1 items
items = pd.concat([items, pd.DataFrame(data['payload']['items'])]).reset_index()

# Shape of dataframe
print(items.shape)

# Looking at dataframe thus far
items.head()

max_page: 3
next_page: /api/v1/items?page=3
(40, 7)

,index,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,1,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,2,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,3,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,4,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

In [7]:
# Requesting information on next_page (page 3)
response = requests.get('https://python.zgulde.net' + data['payload']['next_page'])
data = response.json()

# Inspecting pages
print('max_page: %s' % data['payload']['max_page'])
print('next_page: %s' % data['payload']['next_page'])

# Concatenating page 3 items to pages 1 & 2 items
items = pd.concat([items, pd.DataFrame(data['payload']['items'])]).reset_index()

# Shape of dataframe
print(items.shape)

# Looking at dataframe thus far
items.head()

max_page: 3
next_page: None
(50, 8)

,level_0,index,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,0,0.0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,1,1.0,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,2,2.0,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,3,3.0,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,4,4.0,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

In [8]:

items.shape

(50, 8)

In [9]:
def grab_this(endpoint):
    # Requesting the data from the website
    response = requests.get(f'https://python.zgulde.net/api/v1/{endpoint}')
    
    # Storing data received from request
    data = response.json()
    
    # Creating initial dataframe
    df = pd.DataFrame(data['payload'][endpoint])
    
    # Creating page variable to be checked in while loop
    next_page = data['payload']['next_page']

    
    # Looping through remaining pages
    # First check to make sure there is a next page
    while data['payload']['next_page'] is not None:
        
        # Requesting information on next_page 
        response = requests.get('https://python.zgulde.net' + data['payload']['next_page'])
        data = response.json()

        # Assigning next next_page
        next_page = data['payload']['next_page']

        # Concatenating new page to dataframe
        df = pd.concat([df, pd.DataFrame(data['payload'][endpoint])]).reset_index(drop=True)

    return df

In [10]:
# Testing my new function
test = grab_this('items')
test.shape

(50, 6)

In [11]:
# Success!
test.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

### 2. Do the same thing, but for stores (https://python.zgulde.net/api/v1/stores)

In [12]:
stores = grab_this('stores')
stores.shape

(10, 5)

### 3. Extract the data for sales (https://python.zgulde.net/api/v1/sales). There are a lot of pages of data here, so your code will need to be a little more complex. Your code should continue fetching data from the next page until all of the data is extracted.

In [13]:
sales = grab_this('sales')
sales.shape

(913000, 5)

### 4. Save the data in your files to local csv files so that it will be faster to access in the future.

In [14]:
# Export dataframes to csv files
items.to_csv('items.csv')
stores.to_csv('stores.csv')
sales.to_csv('sales.csv')

### 5. Combine the data from your three separate dataframes into one large dataframe.

In [15]:
# Looking at all my dataframes again
# Here's all my columns in items
items = grab_this('items')
items.head()

,item_brand,item_id,item_name,item_price,item_upc12,item_upc14
0,Riceland,1,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,Caress,2,Caress Velvet Bliss Ultra Silkening Beauty Bar...,6.44,11111065925,11111065925
2,Earths Best,3,Earths Best Organic Fruit Yogurt Smoothie Mixe...,2.43,23923330139,23923330139
3,Boars Head,4,Boars Head Sliced White American Cheese - 120 Ct,3.14,208528800007,208528800007
4,Back To Nature,5,Back To Nature Gluten Free White Cheddar Rice ...,2.61,759283100036,759283100036

In [16]:
# Here's all my columns in stores
stores.head()

             store_address   store_city  store_id store_state store_zipcode
0   12125 Alamo Ranch Pkwy  San Antonio         1          TX         78253
1         9255 FM 471 West  San Antonio         2          TX         78251
2  2118 Fredericksburg Rdj  San Antonio         3          TX         78201
3          516 S Flores St  San Antonio         4          TX         78204
4          1520 Austin Hwy  San Antonio         5          TX         78218

In [17]:
# Here's all my columns in sales
sales.head()

   item  sale_amount                      sale_date  sale_id  store
0     1         13.0  Tue, 01 Jan 2013 00:00:00 GMT        1      1
1     1         11.0  Wed, 02 Jan 2013 00:00:00 GMT        2      1
2     1         14.0  Thu, 03 Jan 2013 00:00:00 GMT        3      1
3     1         13.0  Fri, 04 Jan 2013 00:00:00 GMT        4      1
4     1         10.0  Sat, 05 Jan 2013 00:00:00 GMT        5      1

Much like joining dataframes in SQL, I just need to rename some columns to join these three dataframes!
 - sales.store = stores.store_id
 - items.item_id = sales.item

In [18]:
# I'm gonna rename "store" to "store_id" so I can merge my sales dataframe with my stores dataframe
sales = sales.rename(columns={'store': 'store_id'})
sales.head()

   item  sale_amount                      sale_date  sale_id  store_id
0     1         13.0  Tue, 01 Jan 2013 00:00:00 GMT        1         1
1     1         11.0  Wed, 02 Jan 2013 00:00:00 GMT        2         1
2     1         14.0  Thu, 03 Jan 2013 00:00:00 GMT        3         1
3     1         13.0  Fri, 04 Jan 2013 00:00:00 GMT        4         1
4     1         10.0  Sat, 05 Jan 2013 00:00:00 GMT        5         1

In [19]:
# Merging sales with store
super_dataframe = pd.merge(sales, stores, on='store_id')
super_dataframe

,item,sale_amount,sale_date,sale_id,store_id,store_address,store_city,store_state,store_zipcode
0,1,13.0,"Tue, 01 Jan 2013 00:00:00 GMT",1,1,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
1,1,11.0,"Wed, 02 Jan 2013 00:00:00 GMT",2,1,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
2,1,14.0,"Thu, 03 Jan 2013 00:00:00 GMT",3,1,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
3,1,13.0,"Fri, 04 Jan 2013 00:00:00 GMT",4,1,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
4,1,10.0,"Sat, 05 Jan 2013 00:00:00 GMT",5,1,12125 Alamo Ranch Pkwy,San Antonio,TX,78253
...,...,...,...,...,...,...,...,...,...
912995,50,63.0,"Wed, 27 Dec 2017 00:00:00 GMT",912996,10,8503 NW Military Hwy,San Antonio,TX,78231
912996,50,59.0,"Thu, 28 Dec 2017 00:00:00 GMT",912997,10,8503 NW Military Hwy,San Antonio,TX,78231
912997,50,74.0,"Fri, 29 Dec 2017 00:00:00 GMT",912998,10,8503 NW Military Hwy,San Antonio,TX,78231
912998,50,62.0,"Sat, 30 Dec 2017 00:00:00 GMT",912999,10,8503 NW Military Hwy,San Antonio,TX,78231
912999,50,82.0,"Sun, 31 Dec 2017 00:00:00 GMT",913000,10,8503 NW Military Hwy,San Antonio,TX,78231

In [20]:
# Now to rename
sales = sales.rename(columns={'item': 'item_id'})

# Merging sales with store
super_dataframe = pd.merge(sales, items, on='item_id')
super_dataframe.head()

,item_id,sale_amount,sale_date,sale_id,store_id,item_brand,item_name,item_price,item_upc12,item_upc14
0,1,13.0,"Tue, 01 Jan 2013 00:00:00 GMT",1,1,Riceland,Riceland American Jazmine Rice,0.84,35200264013,35200264013
1,1,11.0,"Wed, 02 Jan 2013 00:00:00 GMT",2,1,Riceland,Riceland American Jazmine Rice,0.84,35200264013,35200264013
2,1,14.0,"Thu, 03 Jan 2013 00:00:00 GMT",3,1,Riceland,Riceland American Jazmine Rice,0.84,35200264013,35200264013
3,1,13.0,"Fri, 04 Jan 2013 00:00:00 GMT",4,1,Riceland,Riceland American Jazmine Rice,0.84,35200264013,35200264013
4,1,10.0,"Sat, 05 Jan 2013 00:00:00 GMT",5,1,Riceland,Riceland American Jazmine Rice,0.84,35200264013,35200264013

In [21]:
super_dataframe.shape

(913000, 10)

In [22]:
super_dataframe.to_csv("superstore.csv")

### 6. Acquire the Open Power Systems Data for Germany, which has been rapidly expanding its renewable energy production in recent years. The data set includes country-wide totals of electricity consumption, wind power production, and solar power production for 2006-2017. You can get the data here: https://raw.githubusercontent.com/jenfly/opsd/master/opsd_germany_daily.csv

In [23]:
# This URL is to a .csv so I'm just gonna read it as such!
OPS = pd.read_csv('https://raw.githubusercontent.com/jenfly/opsd/master/opsd_germany_daily.csv')
OPS

            Date  Consumption     Wind   Solar  Wind+Solar
0     2006-01-01   1069.18400      NaN     NaN         NaN
1     2006-01-02   1380.52100      NaN     NaN         NaN
2     2006-01-03   1442.53300      NaN     NaN         NaN
3     2006-01-04   1457.21700      NaN     NaN         NaN
4     2006-01-05   1477.13100      NaN     NaN         NaN
...          ...          ...      ...     ...         ...
4378  2017-12-27   1263.94091  394.507  16.530     411.037
4379  2017-12-28   1299.86398  506.424  14.162     520.586
4380  2017-12-29   1295.08753  584.277  29.854     614.131
4381  2017-12-30   1215.44897  721.247   7.467     728.714
4382  2017-12-31   1107.11488  721.176  19.980     741.156

[4383 rows x 5 columns]

### 7.Make sure all the work that you have done above is reproducible. That is, you should put the code above into separate functions in the acquire.py file and be able to re-run the functions and get the same data.

In [24]:
# This takes in the data from python.zgulde.net

def grab_this(endpoint):
    """
    This function assumes you know an endpoint for python.zgulde.net and allows the user
    to get the specific data requested. If the data is on more than one page, the function
    loops through until it stops at the last page and returns all this data as single dataframe. 
    """
    # Requesting the data from the website
    response = requests.get(f'https://python.zgulde.net/api/v1/{endpoint}')
    
    # Storing data received from request
    data = response.json()
    
    # Creating initial dataframe
    df = pd.DataFrame(data['payload'][endpoint])
    
    # Creating page variable to be checked in while loop
    next_page = data['payload']['next_page']

    
    # Looping through remaining pages
    # First check to make sure there is a next page
    while data['payload']['next_page'] is not None:
        
        # Requesting information on next_page 
        response = requests.get('https://python.zgulde.net' + data['payload']['next_page'])
        data = response.json()

        # Assigning next next_page
        next_page = data['payload']['next_page']

        # Concatenating new page to dataframe
        df = pd.concat([df, pd.DataFrame(data['payload'][endpoint])]).reset_index(drop=True)

    return df

In [26]:
def fresh_superstore():
    """
    This function is time consuming, but will retreive a fresh dataframe from python.zgulde.net.
    This function requests all the data anew and then merges it into a single dataframe.
    It will also save all individual dataframes as csv files for later use.
    """
    # Grabbing a fresh request for each dataframe
    items = grab_this('items')
    stores = grab_this('stores')
    sales = grab_this('sales')
    
    # Store these dataframes into csv files for later use
    items = pd.read_csv('items.csv')
    stores = pd.read_csv('stores.csv')
    sales = pd.read_csv('sales.csv')
    
    # Renaming some columns to make merging easier 
    sales = sales.rename(columns={'store': 'store_id', 'item': 'item_id'})

    # Merging sales with store
    df = pd.merge(sales, stores, on='store_id')

    # Merging sales with store
    df = pd.merge(df, items, on='item_id')
    
    # Create a csv of the final dataframe
    df = pd.read_csv('superstore.csv')
                                  
    return df

In [28]:
def get_superstore():
    """
    This function utilizes pre-created csv files. It first checks for the superstore.csv
    and if this file has not been made yet, it will create it by calling all the csv
    files from the individual dataframes.
    """
    if os.path.isfile('superstore.csv'):
        # If csv file exists read in data from csv file.
        df = pd.read_csv('superstore.csv', index_col=0)
    else:    
        # Read .csv file for each dataframe
        items = pd.read_csv('items.csv')
        stores = pd.read_csv('stores.csv')
        sales = pd.read_csv('sales.csv')

        # Renaming some columns to make merging easier 
        sales = sales.rename(columns={'store': 'store_id', 'item': 'item_id'})

        # Merging sales with store
        df = pd.merge(sales, stores, on='store_id')

        # Merging sales with store
        df = pd.merge(df, items, on='item_id')

        # Create the csv for the future
        df.to_csv("superstore")
                                  
    return df

In [ ]:
boop

913000 rows and ~14 columns